{
  "nombre": "Rubén Álvarez Fernández",
  "descripcionPersonal": "Soy un profesional dedicado y apasionado que busca constantemente aprender y crecer en mi campo. Me destaco por mi habilidad para resolver problemas de manera creativa y colaborativa.",
  "profesion": "Técnico superior en desarrollo de aplicaciones web",
  "telefono": "+34 688-930-901",
  "proyectos": "https://github.com/NEBUR342",
  "email": "ralvarezfernandez342@gmail.com",
  "redes": [
    {
      "id": 1,
      "nombre": "Linkedin",
      "url": "https://www.linkedin.com/in/ralvarezfernandez/",
      "simbolo":"https://cdn-icons-png.freepik.com/256/3536/3536505.png?ga=GA1.1.935835266.1715188070&semt=ais_hybrid"
    },
    {
      "id": 2,
      "nombre": "Instagram",
      "url": "https://www.instagram.com/nebur342/",
      "simbolo":"https://cdn-icons-png.freepik.com/256/2111/2111463.png?ga=GA1.1.935835266.1715188070&semt=ais_hybrid"
    },
    {
      "id": 3,
      "nombre": "tiktok",
      "url": "https://www.tiktok.com/@ruben_alvarez_fernandez",
      "simbolo":"https://cdn-icons-png.freepik.com/256/3938/3938055.png?ga=GA1.1.935835266.1715188070&semt=ais_hybrid"
    },
    {
      "id": 4,
      "nombre": "facebook",
      "url": "https://www.facebook.com/profile.php?id=100017108250547&locale=es_ES",
      "simbolo":"https://cdn-icons-png.freepik.com/256/13051/13051733.png?ga=GA1.1.935835266.1715188070&semt=ais_hybrid"
    },
    {
      "id": 5,
      "nombre": "twitter",
      "url": "https://twitter.com/NEBUR342",
      "simbolo":"https://cdn-icons-png.freepik.com/256/3256/3256013.png?ga=GA1.1.935835266.1715188070&semt=ais_hybrid"
    }
  ],
  "aptitudes": [
    {
      "id": 1,
      "nombre": "Capacidad de adaptación"
    },
    {
      "id": 2,
      "nombre": "Resolución de problemas"
    },
    {
      "id": 3,
      "nombre": "Habilidades comunicativas"
    },
    {
      "id": 4,
      "nombre": "Habilidad multitarea"
    },
    {
      "id": 5,
      "nombre": "Pensamiento creativo"
    }
  ],
  "detallesAdicionales": [
    {
      "id": 1,
      "nombre": "Disponibilidad inmediata"
    },
    {
      "id": 2,
      "nombre": "Flexibilidad horaria"
    },
    {
      "id": 3,
      "nombre": "Movilidad geográfica"
    },
    {
      "id": 4,
      "nombre": "Carnet de conducir"
    }
  ],
  "experiencias": [
    {
      "id": 1,
      "nombreEmpresa": "Globomatik",
      "nombrePuesto": "Desarrollador web",
      "lugar": "Almería",
      "fechaInicio": "19/09/2023",
      "fechaFin": "30/11/2023",
      "descripcion": "Prácticas realizadas por parte del Grado superior. En la empresa realizaba proyectos en la intranet como formularios para facturas y aprender una nueva tecnología, el uso de Datatable. Tecnologías usadas: Bootstrap, HTML, CSS, PHP, Laravel y Datatable"
    },
    {
      "id": 2,
      "nombreEmpresa": "EnMemoria",
      "nombrePuesto": "Desarrollador web",
      "lugar": "Almería",
      "fechaInicio": "03/06/2024",
      "fechaFin": "05/08/2024",
      "descripcion": "Actualmente colaborando en el desarrollo de En Memoria, plataforma online  diseñada para publicación y consulta de esquelas. Ademas de diferentes servicios  para facilitar la comunicación entre familiares y allegados."
    }
  ],
  "voluntariados": [
    {
      "id": 1,
      "nombreEmpresa": "Asociación ANÍMATE",
      "nombrePuesto": "Limpieza de restos arqueológicos",
      "lugar": "Toledo",
      "fechaInicio": "10/8/2021",
      "fechaFin": "24/8/2021",
      "descripcion": "Voluntariado en el que se realizó una labor de limpieza en una zona de restos arqueológicos junto a otros voluntarios, mejoró la capacidad para realizar trabajos en equipo."
    },
    {
      "id": 2,
      "nombreEmpresa": "Asociación ANÍMATE",
      "nombrePuesto": " Rutas culturales",
      "lugar": "Toledo",
      "fechaInicio": "24/07/2022",
      "fechaFin": " 07/08/2022",
      "descripcion": "Dinamizar actos de cultura desarrollando escenarios y diálogos entre personajes y posteriormente interpretar la obra en las calles de Toledo con los otros voluntarios, aumentó la capacidad de comunicación."
    }
  ],
  "estudios": [
    {
      "id": 1,
      "nombreCurso": "ESO",
      "centro": "IES Carlos III",
      "lugar": "Aguadulce - Almería",
      "fechaInicio": "Septiembre de 2014",
      "fechaFin": "Junio de 2018"
    },
    {
      "id": 2,
      "nombreCurso": "Bachillerato - Ciencias sociales",
      "centro": "IES Almeraya",
      "lugar": "Almería",
      "fechaInicio": "Septiembre de 2018",
      "fechaFin": "Julio de 2020"
    },
    {
      "id": 3,
      "nombreCurso": "Técnico superior en desarrollo de aplicaciones web (DAW)",
      "centro": "IES Al-Andalus",
      "lugar": "Almería",
      "fechaInicio": "Septiembre de 2020",
      "fechaFin": "Diciembre 2023"
    },
    {
      "id": 4,
      "nombreCurso": "Python & Deep Learning",
      "centro": "InfoThot",
      "lugar": "Telemático",
      "fechaInicio": "Julio de 2024",
      "fechaFin": "Realizándose"
    }
  ],
  "idiomas": [
    {
      "id": 1,
      "nombre": "Español",
      "nivel": "Nativo"
    },
    {
      "id": 2,
      "nombre": "Inglés",
      "nivel": "B1"
    }
  ],
  "lenguajes": [
    {
      "id": 1,
      "nombre": "HTML",
      "descripcion": "HTML, abreviatura de HyperText Markup Language, es el estándar para crear páginas web. Es un lenguaje de marcado que define la estructura y el contenido de una página, como texto, imágenes y otros elementos multimedia.",
      "url":"https://developer.mozilla.org/es/docs/Web/HTML"
    },
    {
      "id": 2,
      "nombre": "CSS",
      "descripcion": "CSS, o Cascading Style Sheets, es el lenguaje que se utiliza para diseñar y dar formato a las páginas web. Con CSS, puedes controlar el diseño, el posicionamiento y el estilo de elementos HTML, permitiendo crear sitios web visualmente atractivos.",
      "url":"https://developer.mozilla.org/es/docs/Web/CSS"
    },
    {
      "id": 3,
      "nombre": "JavaScript",
      "descripcion": "JavaScript es un lenguaje de scripting ampliamente utilizado en el desarrollo web para agregar interactividad y dinamismo a las páginas. Se ejecuta en el navegador y es esencial para crear aplicaciones web modernas.",
      "url":"https://developer.mozilla.org/es/docs/Web/JavaScript"
    },
    {
      "id": 4,
      "nombre": "PHP",
      "descripcion": "PHP es un lenguaje de programación de código abierto diseñado para el desarrollo web del lado del servidor. Es ampliamente utilizado para crear sitios web dinámicos y aplicaciones web interactivas.",
      "url":"https://www.php.net"
    },
    {
      "id": 5,
      "nombre": "MySQL",
      "descripcion": "MySQL es un sistema de gestión de bases de datos relacionales de código abierto. Se utiliza para almacenar y gestionar datos en aplicaciones web y empresariales. MySQL es conocido por su confiabilidad y facilidad de uso.",
      "url":"https://www.mysql.com"
    },
    {
      "id": 6,
      "nombre": "Java",
      "descripcion": "Java es un lenguaje de programación multiplataforma y orientado a objetos utilizado para desarrollar aplicaciones empresariales, aplicaciones de escritorio y aplicaciones móviles. Es conocido por su robustez y portabilidad.",
      "url":"https://www.java.com"
    }
  ],
  "frameworks": [
    {
      "id": 1,
      "nombre": "Laravel",
      "descripcion": "Laravel es un framework de PHP para desarrollo de backend. Ofrece una estructura organizada y herramientas poderosas para simplificar el desarrollo de aplicaciones web escalables y mantenibles.",
      "url":"https://laravel.com"
    },
    {
      "id": 2,
      "nombre": "Vue.js",
      "descripcion": "Vue.js es un framework de JavaScript para la creación de interfaces de usuario y aplicaciones web. Se caracteriza por su facilidad de uso y su flexibilidad, permitiendo a los desarrolladores agregar interactividad a sus proyectos de forma sencilla.",
      "url":"https://vuejs.org"
    },
    {
      "id": 3,
      "nombre": "React",
      "descripcion": "React es una biblioteca de JavaScript para la construcción de interfaces de usuario interactivas. Permite a los desarrolladores crear componentes reutilizables y facilita el desarrollo de aplicaciones web de una sola página.",
      "url":"https://es.react.dev"
    },
    {
      "id": 4,
      "nombre": "Mui",
      "descripcion": "MUI es un framework de React que proporciona componentes de interfaz de usuario siguiendo el diseño de Material Design, ideal para crear aplicaciones web modernas y consistentes.",
      "url":"https://mui.com"
    },
    {
      "id": 5,
      "nombre": "Bootstrap",
      "descripcion": "Bootstrap es un framework de frontend que facilita la creación de sitios web responsivos y móviles. Proporciona una serie de componentes predefinidos como botones, formularios y menús, lo que agiliza el proceso de desarrollo.",
      "url":"https://getbootstrap.com"
    },
    {
      "id": 6,
      "nombre": "Tailwind CSS",
      "descripcion": "Tailwind CSS es un framework de diseño que permite a los desarrolladores aplicar estilos a través de clases predefinidas. A diferencia de otros frameworks, Tailwind fomenta la creación de diseños personalizados y flexibles.",
      "url":"https://tailwindcss.com"
    }
  ],
  "tecnologias": [
    {
      "id": 1,
      "nombre": "Git",
      "descripcion": "Git es un sistema de control de versiones distribuido. Se utiliza para gestionar el código fuente de proyectos de software, permitiendo la colaboración entre desarrolladores y la creación de diferentes ramas para el desarrollo.",
      "url": "https://git-scm.com"
    },
    {
      "id": 2,
      "nombre": "GitHub",
      "descripcion": "GitHub es una plataforma de alojamiento para proyectos de Git. Ofrece herramientas de colaboración, como repositorios, control de versiones y flujos de trabajo, para ayudar a los desarrolladores a trabajar juntos en proyectos de software.",
      "url": "https://github.com"
    },
    {
      "id": 3,
      "nombre": "GitLab",
      "descripcion": "GitLab es una plataforma de DevOps que combina el control de versiones con herramientas para la integración continua, la entrega continua y la gestión de proyectos. Facilita el ciclo completo de desarrollo y despliegue de software.",
      "url": "https://about.gitlab.com"
    },
    {
      "id": 4,
      "nombre": "AWS",
      "descripcion": "AWS, o Amazon Web Services, es una plataforma de servicios en la nube que ofrece una amplia gama de soluciones, incluyendo almacenamiento, bases de datos, computación y más. Es utilizada por empresas para escalar sus operaciones en la nube.",
      "url": "https://aws.amazon.com/es/free"
    },
    {
      "id": 5,
      "nombre": "Docker",
      "descripcion": "Docker es una plataforma de virtualización basada en contenedores. Permite a los desarrolladores empaquetar aplicaciones y sus dependencias en contenedores ligeros y portátiles, facilitando el despliegue y la colaboración.",
      "url": "https://www.docker.com"
    },
    {
      "id": 6,
      "nombre": "XAMPP",
      "descripcion": "XAMPP es un entorno de desarrollo local que incluye Apache, MySQL, PHP y Perl. Se utiliza para crear entornos de desarrollo local para pruebas y desarrollo de aplicaciones web antes de implementarlas en producción.",
      "url": "https://www.apachefriends.org/es/index.html"
    },
    {
      "id": 7,
      "nombre": "Datatables",
      "descripcion": "Datatables es una biblioteca de JavaScript que permite crear tablas interactivas en sitios web. Proporciona características avanzadas como búsqueda, ordenación y paginación para mejorar la experiencia del usuario.",
      "url": "https://datatables.net"
    },
    {
      "id": 8,
      "nombre": "WordPress",
      "descripcion": "WordPress es un sistema de gestión de contenidos (CMS) de código abierto que permite crear y gestionar sitios web de forma sencilla. Es altamente personalizable con temas y plugins.",
      "url": "https://wordpress.org"
    },
    {
      "id": 9,
      "nombre": "Elementor",
      "descripcion": "Elementor es un constructor de páginas para WordPress que permite a los usuarios crear sitios web con un diseño personalizado mediante un editor visual de arrastrar y soltar.",
      "url": "https://elementor.com"
    }
  ]
}
